wiciu15/NRF51_CAN_BLE_HID_Multimedia/src/main.c
        case PM_EVT_STORAGE_FULL:
        {
            // Run garbage collection on the flash.
            err_code = fds_gc();
            if (err_code == FDS_ERR_BUSY || err_code == FDS_ERR_NO_SPACE_IN_QUEUES)
            {
                // Retry.
            }
            else
            {
                APP_ERROR_CHECK(err_code);
            }
        } break;

        case PM_EVT_PEERS_DELETE_SUCCEEDED:
        {
            advertising_start();
        } break;

        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
        {
            // The local database has likely changed, send service changed indications.
            pm_local_database_has_changed();
        } break;

        case PM_EVT_PEER_DATA_UPDATE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peer_data_update_failed.error);
        } break;

        case PM_EVT_PEER_DELETE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peer_delete_failed.error);
        } break;

        case PM_EVT_PEERS_DELETE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peers_delete_failed_evt.error);
        } break;

        case PM_EVT_ERROR_UNEXPECTED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.error_unexpected.error);
        } break;

        case PM_EVT_CONN_SEC_START:
        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
        case PM_EVT_PEER_DELETE_SUCCEEDED:
        case PM_EVT_LOCAL_DB_CACHE_APPLIED:
        case PM_EVT_SERVICE_CHANGED_IND_SENT:
        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
        default:
            break;
    }
}


/**@brief Function for handling Service errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void service_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling advertising errors.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void ble_advertising_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for performing a battery measurement, and update the Battery Level characteristic in the Battery Service.
 */
static void battery_level_update(void)
{
    uint32_t err_code;
    uint8_t  battery_level;

    battery_level = 69;

    err_code = ble_bas_battery_level_update(&m_bas, battery_level);
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != BLE_ERROR_NO_TX_PACKETS) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
       )
    {
        APP_ERROR_HANDLER(err_code);
    }
}

static void LED_blink(void){
	app_timer_start(m_blink,LED_BLINK_TIME,NULL);
	nrf_gpio_pin_clear(14);
}

/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    battery_level_update();
}

/**@brief Function for sending a report with given multimedia key pressed
 *
 * @details Function sends HID report with appropriate key pressed and triggers one-shot timer which sends an empty report (all key release) after few ms
 */
static void hid_multimedia_send_key(uint8_t key){
	uint8_t report[2]={0x01,0}; //empty hid report with no keys pressed
	    report[1] |= 1<<key;
	    uint32_t err_code = ble_hids_inp_rep_send(&m_hids,
	                                                 INPUT_REPORT_KEYS_INDEX,
	                                                 INPUT_REPORT_KEYS_MAX_LEN,
	                                                 report);
	    app_timer_start(m_key_release_interval_id,KEY_RELEASE_REPORT_INTERVAL,NULL); //send empty report after a delay to simulate key release
	    NRF_LOG_INFO("HID report %X;%X;\r\n",report[0],report[1]);
}


static void key_release_timer_timeout_handler(void * p_context){
	UNUSED_PARAMETER(p_context);
	uint8_t report[2]={0x01,0}; //hid report with no keys pressed
	uint32_t err_code = ble_hids_inp_rep_send(&m_hids,
			INPUT_REPORT_KEYS_INDEX,
			INPUT_REPORT_KEYS_MAX_LEN,
			report);
	NRF_LOG_INFO("HID report %X;%X;\r\n",report[0],report[1]);
}

/**@brief Function for entering sleep mode in mcp2515 and system off of NRF51 MCU
 *
 * @details Function sets up mcp2515 chip to go to power saving mode, and only generate an interrupt when CAN bus activity occurred
 * 			Sleep mode is requested after a delay because vehicles CAN bus can remain active after disconnecting a phone
 * 			CAN bus can be active even when vehicle is parked/charging etc. in that case the system will boot up, wait for connection
 * 			for defined delay and then go to sleep again. If CAN bus activity occurred because driver opened the vehicle, his phone
 * 			should connect with BLE thus stopping the delay timer till BLE disconnection event.
 * 			MCU enters power off mode with opportunity to be waken up with pin connected to MCP2515 interrupt pin
 * 			When MCP2515 detects CAN bus activity the generated interrupt wakes up the MCU, and sice no RAM retention is configured
 * 			it should start executing from the beginning
 */

static void sleep_delay_timer_timeout_handler(void * p_context){
	UNUSED_PARAMETER(p_context);
	NRF_LOG_INFO("Requesting sleep mode\r\n");
	mcp2515_sleep();
	nrf_gpio_cfg_sense_input(MCP2515_INT_PIN,NRF_GPIO_PIN_PULLUP,NRF_GPIO_PIN_SENSE_LOW);
	LED_blink();

	// Configure nRF51 RAM retention parameters. Set for System Off 0kB RAM retention
	NRF_POWER->RAMON = POWER_RAMON_ONRAM0_RAM0On   << POWER_RAMON_ONRAM0_Pos
			| POWER_RAMON_ONRAM1_RAM1On   << POWER_RAMON_ONRAM1_Pos
			| POWER_RAMON_OFFRAM0_RAM0Off << POWER_RAMON_OFFRAM0_Pos
			| POWER_RAMON_OFFRAM1_RAM1Off << POWER_RAMON_OFFRAM1_Pos;
	NRF_POWER->RAMONB = POWER_RAMONB_ONRAM2_RAM2Off   << POWER_RAMONB_ONRAM2_Pos
			| POWER_RAMONB_ONRAM3_RAM3Off   << POWER_RAMONB_ONRAM3_Pos
			| POWER_RAMONB_OFFRAM2_RAM2Off  << POWER_RAMONB_OFFRAM2_Pos
			| POWER_RAMONB_OFFRAM3_RAM3Off  << POWER_RAMONB_OFFRAM3_Pos;

NRF_POWER->SYSTEMOFF=1; //go to system off
}

